# GetWSFromImage

## Description
Returns a handle to the worksheet being displayed by a worksheet image object..

```pascal
FUNCTION GetWSFromImage(worksheetImage : HANDLE) : HANDLE;
```

```python

def vs.GetWSFromImage(worksheetImage):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|worksheetImage|HANDLE|Handle to worksheet image object.|

## Version
Availability: from VectorWorks9.0
## Category
* Worksheets